newwms_gift/src/Reports/ит_WMS_ДанныеИнвентаризации/ит_WMS_ДанныеИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ит_WMS_ДанныеИнвентаризации</name>
</mdclass:Report>

newwms_gift/src/Documents/итWMSДанныеИнвентаризации/итWMSДанныеИнвентаризации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSДанныеИнвентаризации</name>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSЗадачиИнвентаризации</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ДатаИнвентаризации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Reports/ит_WMS_ДанныеИнвентаризации/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	для Каждого Элемент из КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы  цикл
		Если Элемент.Параметр=новый ПараметрКомпоновкиДанных("ДокументНачалаИнвенторизации") тогда
			
			
			 ДатаНачалаИнвенторизации=ПолучитьМинимальнуюДатуСканированияЯчейкиДокумента(Элемент.Значение.Ссылка);
			 Если ДатаНачалаИнвенторизации=Неопределено Тогда 
				 Сообщить("Указаны не верные параметры");
				 Возврат
			 КонецЕсли;
			 КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодДо",новый Граница(новый МоментВремени(ДатаНачалаИнвенторизации,Элемент.Значение.Ссылка),ВидГраницы.Исключая));	
			  КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодДоДата",ДатаНачалаИнвенторизации);	

		КонецЕсли;
		Если Элемент.Параметр=новый ПараметрКомпоновкиДанных("ДокументОкончанияИнвенторизации") тогда
			 ДатаОкончанияИнвенторизации=ПолучитьМаксимальнуюДатуСканированияЯчейкиДокумента(Элемент.Значение.Ссылка);
			 Если ДатаОкончанияИнвенторизации=Неопределено Тогда 
				 Сообщить("Указаны не верные параметры");
				 Возврат
			 КонецЕсли;

		 //КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодПосле",новый Граница(новый МоментВремени(ДатаОкончанияИнвенторизации,Элемент.Значение.Ссылка),ВидГраницы.Включая));
		  КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодПослеДата",ДатаОкончанияИнвенторизации);
		КонецЕсли;

		КонецЦикла;
	КонецПроцедуры

	
Функция ПолучитьМинимальнуюДатуСканированияЯчейкиДокумента(Документ)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(итWMSДанныеИнвентаризацииТовары.ДатаИнвентаризации) КАК ДатаИнвентаризации,
		|	итWMSДанныеИнвентаризацииТовары.Ссылка
		|ИЗ
		|	Документ.итWMSДанныеИнвентаризации.Товары КАК итWMSДанныеИнвентаризацииТовары
		|ГДЕ
		|	итWMSДанныеИнвентаризацииТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSДанныеИнвентаризацииТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.ДатаИнвентаризации=null тогда
			Возврат Неопределено;
		иначе
			Возврат ВыборкаДетальныеЗаписи.ДатаИнвентаризации;
		КонецЕсли;	
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		
КонецФункции
функция ПолучитьМаксимальнуюДатуСканированияЯчейкиДокумента(Документ)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(итWMSДанныеИнвентаризацииТовары.ДатаИнвентаризации) КАК ДатаИнвентаризации,
		|	итWMSДанныеИнвентаризацииТовары.Ссылка
		|ИЗ
		|	Документ.итWMSДанныеИнвентаризации.Товары КАК итWMSДанныеИнвентаризацииТовары
		|ГДЕ
		|	итWMSДанныеИнвентаризацииТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSДанныеИнвентаризацииТовары.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  ВыборкаДетальныеЗаписи.Следующий() Тогда
		Если ВыборкаДетальныеЗаписи.ДатаИнвентаризации=null тогда
			Возврат Неопределено;
		иначе
			Возврат ВыборкаДетальныеЗаписи.ДатаИнвентаризации;
		КонецЕсли;	
	КонецЕсли;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		
КонецФункции
